In [25]:
import script

In [26]:
script.sayHello('Rujal')

Hello! Rujal

In [27]:
dir(script)

['__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 'sayHello']

In [28]:
script.sayHello

In [29]:
station_names = ["lighthouse", "Harmaja", "Suomenlinna aaltopoiju", "Kumpula", "Kaisaniemi"]
first_years = [2003, 1989, 2016, 2005, 1844]

In [30]:
station_names += ['Malmi airfield', 'Vusaari harbour', 'Kaivopuisto']
first_years += [1937, 2012, 1904]

In [31]:
print(station_names, first_years)

['lighthouse', 'Harmaja', 'Suomenlinna aaltopoiju', 'Kumpula', 'Kaisaniemi', 'Malmi airfield', 'Vusaari harbour', 'Kaivopuisto'] [2003, 1989, 2016, 2005, 1844, 1937, 2012, 1904]

In [32]:
stations_sorted = sorted(zip(station_names, first_years), key = lambda x: x[0])
station_names_sorted = [x[0] for x in stations_sorted]
start_years_sorted_by_name = [x[1] for x in stations_sorted]

In [33]:
years_sorted = sorted(zip(station_names, first_years), key=lambda x: x[1], reverse=True)
first_years_sorted = [x[1] for x in years_sorted]
station_names_sorted_by_recent_years = [x[0] for x in years_sorted]

In [34]:
months = ['January',
'February',
'March',
'April',
'May',
'June',
'July',
'August',
'September',
'October',
'November',
'December'
]

temperatures = [-3.5,-4.5,-1.0,4.0,10.0,15.0,18.0,16.0,11.5,6.0,2.0,-1.5]

In [35]:
average_temperatures = list(zip(months, temperatures))

In [36]:
def print_average_temperature(idx):
  month, temp = average_temperatures[idx]
  print(f"The average temperature in Helsinki during {month} is {temp}")

In [37]:
print_average_temperature(1)

The average temperature in Helsinki during February is -4.5

In [38]:
stations = [f"Station_{i}.txt" for i in range(21)]
print(stations)

['Station_0.txt', 'Station_1.txt', 'Station_2.txt', 'Station_3.txt', 'Station_4.txt', 'Station_5.txt', 'Station_6.txt', 'Station_7.txt', 'Station_8.txt', 'Station_9.txt', 'Station_10.txt', 'Station_11.txt', 'Station_12.txt', 'Station_13.txt', 'Station_14.txt', 'Station_15.txt', 'Station_16.txt', 'Station_17.txt', 'Station_18.txt', 'Station_19.txt', 'Station_20.txt']

In [39]:
temperatures = [-5.4, 1.0, -1.3, -4.8, 3.9, 0.1, -4.4, 4.0, -2.2, -3.9, 4.4,
                -2.5, -4.6, 5.1, 2.1, -2.4, 1.9, -3.3, -4.8, 1.0, -0.8, -2.8,
                -0.1, -4.7, -5.6, 2.6, -2.7, -4.6, 3.4, -0.4, -0.9, 3.1, 2.4,
                1.6, 4.2, 3.5, 2.6, 3.1, 2.2, 1.8, 3.3, 1.6, 1.5, 4.7, 4.0,
                3.6, 4.9, 4.8, 5.3, 5.6, 4.1, 3.7, 7.6, 6.9, 5.1, 6.4, 3.8,
                4.0, 8.6, 4.1, 1.4, 8.9, 3.0, 1.6, 8.5, 4.7, 6.6, 8.1, 4.5,
                4.8, 11.3, 4.7, 5.2, 11.5, 6.2, 2.9, 4.3, 2.8, 2.8, 6.3, 2.6,
                -0.0, 7.3, 3.4, 4.7, 9.3, 6.4, 5.4, 7.6, 5.2]

In [40]:
import pandas as pd

In [41]:
df = pd.read_csv('temperatures.csv')
df.head(20)

,Observation station,Year,Month,Day,Time [Local time],Average temperature [째C],Maximum temperature [째C],Minimum temperature [째C],Minimum ground temperature [째C]
0,Inari Seitalaassa,2024,7,17,03:00,20.8,25.3,17.2,-
1,Inari Seitalaassa,2024,7,18,03:00,19.3,23.6,16.5,-
2,Inari Seitalaassa,2024,7,19,03:00,17.3,20.4,14.6,-
3,Inari Seitalaassa,2024,7,20,03:00,20.2,25.5,16.5,-
4,Inari Seitalaassa,2024,7,21,03:00,22.6,27.7,17.2,-
5,Inari Seitalaassa,2024,7,22,03:00,22.5,25.4,20.2,-
6,Inari Seitalaassa,2024,7,23,03:00,22.7,27.0,19.9,-
7,Inari Seitalaassa,2024,7,24,03:00,22.5,26.6,20.1,-
8,Inari Seitalaassa,2024,7,25,03:00,19.3,23.9,15.3,-
9,Inari Seitalaassa,2024,7,26,03:00,22.5,26.0,17.8,-
10,Inari Seitalaassa,2024,7,27,03:00,22.0,26.2,18.7,-
11,Inari Seitalaassa,2024,7,28,03:00,20.3,24.5,18.9,-
12,Inari Seitalaassa,2024,7,29,03:00,17.2,20.1,16.5,-
13,Inari Seitalaassa,2024,7,30,03:00,14.9,17.8,13.3,-
14,Inari Seitalaassa,2024,7,31,03:00,14.5,16.5,13.4,-
15,Inari Seitalaassa,2024,8,1,03:00,12.8,15.1,11.7,-
16,Inari Seitalaassa,2024,8,2,03:00,13.4,16.4,11.7,-
17,Inari Seitalaassa,2024,8,3,03:00,14.0,17.2,11.9,-
18,Inari Seitalaassa,2024,8,4,03:00,13.6,19.2,9.9,-
19,Inari Seitalaassa,2024,8,5,03:00,14.9,18.2,12.0,-

In [42]:
len(df)

365

In [43]:
df.shape

(365, 9)

In [44]:
df.columns.values

array(['Observation station', 'Year', 'Month', 'Day', 'Time [Local time]',
       'Average temperature [째C]', 'Maximum temperature [째C]',
       'Minimum temperature [째C]', 'Minimum ground temperature [째C]'],
      dtype=object)

In [45]:
df.index

RangeIndex(start=0, stop=365, step=1)

In [46]:
len(df.columns)

9

In [47]:
df.Year.unique()

array([2024, 2025])

In [48]:
df['Maximum temperature [째C]'].mean()

np.float64(5.206301369863013)

In [49]:
df = pd.read_csv('kumpula-summer-2024.txt', comment='#')

In [50]:
df.head()

   YEARMODA   MAX   MIN  TEMP1  TEMP2
0  20240601  26.2  18.4   24.2   23.2
1  20240602  24.4  17.1   20.7   24.2
2  20240603  25.7  15.2   22.5   23.1
3  20240604  24.6  15.7   19.3   24.6
4  20240605  23.4  12.8   20.3   23.2

In [51]:
df['Diff'] = 0.0

In [52]:
df.head()

   YEARMODA   MAX   MIN  TEMP1  TEMP2  Diff
0  20240601  26.2  18.4   24.2   23.2   0.0
1  20240602  24.4  17.1   20.7   24.2   0.0
2  20240603  25.7  15.2   22.5   23.1   0.0
3  20240604  24.6  15.7   19.3   24.6   0.0
4  20240605  23.4  12.8   20.3   23.2   0.0

In [53]:
df['Diff'] = df['MAX'] - df['MIN']
df.head()

   YEARMODA   MAX   MIN  TEMP1  TEMP2  Diff
0  20240601  26.2  18.4   24.2   23.2   7.8
1  20240602  24.4  17.1   20.7   24.2   7.3
2  20240603  25.7  15.2   22.5   23.1  10.5
3  20240604  24.6  15.7   19.3   24.6   8.9
4  20240605  23.4  12.8   20.3   23.2  10.6

In [54]:
df['Temp'] = (df['TEMP1'] + df['TEMP2']) / 2
df.head()

   YEARMODA   MAX   MIN  TEMP1  TEMP2  Diff   Temp
0  20240601  26.2  18.4   24.2   23.2   7.8  23.70
1  20240602  24.4  17.1   20.7   24.2   7.3  22.45
2  20240603  25.7  15.2   22.5   23.1  10.5  22.80
3  20240604  24.6  15.7   19.3   24.6   8.9  21.95
4  20240605  23.4  12.8   20.3   23.2  10.6  21.75

Calculate the mean temperature for the last seven days of August 2024. Do the selection using the row index values.

In [55]:
df.loc[85:91, "Temp"].mean()

np.float64(19.671428571428574)

In [56]:
hot_temps = df[df['MAX'] > 25]
hot_temps

    YEARMODA   MAX   MIN  TEMP1  TEMP2  Diff   Temp
0   20240601  26.2  18.4   24.2   23.2   7.8  23.70
2   20240603  25.7  15.2   22.5   23.1  10.5  22.80
24  20240625  25.7  12.3   20.6   25.0  13.4  22.80
25  20240626  25.7  15.9   22.2   25.5   9.8  23.85
27  20240628  27.2  17.0   25.4   27.2  10.2  26.30
51  20240722  25.1  16.9   22.3   24.7   8.2  23.50
54  20240725  26.1  18.5   22.3   26.1   7.6  24.20
55  20240726  26.7  17.9   24.3   26.4   8.8  25.35
56  20240727  25.1   NaN   22.7   24.8   NaN  23.75
85  20240825  25.9  14.4   19.0   25.9  11.5  22.45

In [57]:
len(hot_temps)

10

In [58]:
hot_temps.MAX.hasnans

False

In [59]:
hot_temps.MIN.hasnans

True

In [61]:
df.head()

   YEARMODA   MAX   MIN  TEMP1  TEMP2  Diff   Temp
0  20240601  26.2  18.4   24.2   23.2   7.8  23.70
1  20240602  24.4  17.1   20.7   24.2   7.3  22.45
2  20240603  25.7  15.2   22.5   23.1  10.5  22.80
3  20240604  24.6  15.7   19.3   24.6   8.9  21.95
4  20240605  23.4  12.8   20.3   23.2  10.6  21.75

In [64]:
df['YEARMODA_STR'] = df["YEARMODA"].astype(str)
df.head()

   YEARMODA   MAX   MIN  TEMP1  TEMP2  Diff   Temp YEARMODA_STR
0  20240601  26.2  18.4   24.2   23.2   7.8  23.70     20240601
1  20240602  24.4  17.1   20.7   24.2   7.3  22.45     20240602
2  20240603  25.7  15.2   22.5   23.1  10.5  22.80     20240603
3  20240604  24.6  15.7   19.3   24.6   8.9  21.95     20240604
4  20240605  23.4  12.8   20.3   23.2  10.6  21.75     20240605

In [65]:
df['YEAR_MONTH'] = df['YEARMODA_STR'].str.slice(start=0, stop=6)
df.head()

   YEARMODA   MAX   MIN  TEMP1  TEMP2  Diff   Temp YEARMODA_STR YEAR_MONTH
0  20240601  26.2  18.4   24.2   23.2   7.8  23.70     20240601     202406
1  20240602  24.4  17.1   20.7   24.2   7.3  22.45     20240602     202406
2  20240603  25.7  15.2   22.5   23.1  10.5  22.80     20240603     202406
3  20240604  24.6  15.7   19.3   24.6   8.9  21.95     20240604     202406
4  20240605  23.4  12.8   20.3   23.2  10.6  21.75     20240605     202406

In [70]:
df['YEAR_MONTH'].unique()

array(['202406', '202407', '202408'], dtype=object)

In [74]:
grouped = df.groupby('YEAR_MONTH')

In [76]:
grouped.groups.keys()

dict_keys(['202406', '202407', '202408'])